#include <iostream>
using namespace std;

int main() {
    srand(time(0));
    int s[5][3];
    for (int i = 0; i < 5; i++) {
        for (int j = 0; j < 3; j++) {
            s[i][j] = rand() % 9 + 1;
        }
    }
    cout << "------------------------------------------\n";
    cout << "|               Подьезд №4               |\n";
    cout << "------------------------------------------\n";
    cout << "|№ этажа|1 квартира|2 квартира|3 квартира|\n";
    cout << "------------------------------------------\n";
    for (int i = 4; i >= 0; i--) {
        cout << "|    " << i + 1 << "-й этаж |";
        for (int j = 0; j < 3; j++) {
            cout << s[i][j] << "    |    ";
        }
        cout << "\n------------------------------------------\n";
    }
    int p, k;
    cout << "Введите номер этажа (1-5): ";
    cin >> p;
    while (p < 1 or p > 5) {
      cout << "Номер этажа должен быть от 1 до 5, попробуйте ещё раз: ";
      cin >> p;
    }
    cout << "Введите номер квартиры: ";
    cin >> k;
    while (k < 1 or k > 3) {
      cout << "Номер квартиры должен быть от 1 до 3, попробуйте ещё раз: ";
      cin >> k;
    }
    cout << "В "<<k<<" квартире на "<<p<< " этаже живёт " << s[p-1][k-1] << " людей\n";
    for (int i = 1; i < 6; i++) {
        p = i;
        cout << "На " << i << " этаже живут " << s[p - 1][0] + s[p - 1][1]+s[p-1][2] << endl;
    }
    cout << "------------------------------------------\n";
    cout << "|               Подьезд №4               |\n";
    cout << "------------------------------------------\n";
    cout << "|№ этажа|1 квартира|2 квартира|3 квартира|\n";
    cout << "------------------------------------------\n";
    for (int i = 4; i >= 0; i--) {
        cout << "|    " << i + 1 << "-й этаж |";
        for (int j = 0; j < 3; j++) {
            cout << s[i][j] << "    |    ";
        }
        cout << "\n------------------------------------------\n";
    }
}