#include <iostream>
using namespace std;

int main() {
    int s[7][10];
    char v;
while (true) {
    cout << "Вы хотите выйти (y/n): ";
    cin >> v;
    
    if (v == 'y' || v == 'Y') {
        exit(0);
    } else if (v == 'n' || v == 'N') {
        break;
    } else {
        cout << "Введите n или y: \n";
    }
}   
    for (int i = 0; i < 7; i++) {
        for (int j = 0; j < 10; j++) {
            s[i][j] = j + 1;
        }
    }
    cout << "----------------------------------------------------\n";
    cout << "|        Таблица паркомест (0-место занято)        |\n";
    cout << "----------------------------------------------------\n";
    for (int i = 6; i >= 0; i--) {
        cout << "|" << i+1 << "-й этаж | ";
        for (int j = 0; j < 10; j++) {
            cout << s[i][j] << " | ";
        }
        cout << "\n----------------------------------------------------\n";
    }
    int p, m;
    while (true) {
        cout << "Введите номер этажа: ";
        cin >> p;
        while (p < 1 or p > 7) {
            cout << "Этаж не правильный, ножно от 1 до 7: ";
            cin >> p;
        }
        cout << "Введите номер места: ";
        cin >> m;
        while (m < 1 or m > 10) {
            cout << "Номер места не правильный, ножно от 1 до 10: ";
            cin >> m;
        }
        if (s[p-1][m-1] == 0) {
            cout << "Место занятое! Выберете другое место\n";
        }
        else {
            cout << "Место свободное! вы выбрали место " << p <<"-го этажа, " << m << " места\n"; 
            s[p - 1][m - 1] = 0;
        }
        cout << "----------------------------------------------------\n";
        cout << "|        Таблица паркомест (0-место занято)        |\n";
        cout << "----------------------------------------------------\n";
    for (int i = 6; i >= 0; i--) {
        cout << "|" << i+1 << "-й этаж | ";
        for (int j = 0; j < 10; j++) {
            cout << s[i][j] << " | ";
        }
        cout << "\n----------------------------------------------------\n";
        }
        while (true) {
    cout << "Вы хотите выйти (y/n): ";
    cin >> v;
    
    if (v == 'y' || v == 'Y') {
        exit(0);
    } else if (v == 'n' || v == 'N') {
        break;
    } else {
        cout << "Введите n или y: \n";
    }
}   
    }
}