#include <iostream>
using namespace std;
int main()
{
    srand(time(0));
    int s[2][12];
    for(int i = 0; i < 2; i++){
        for(int j = 0; j < 12; j++){
            s[i][j] = rand()%90+10;
        }
    }
    cout<<"------------------------------------------------------------------\n";
    cout<<"|                 Таблиця опадів за 2024-2025 роки               |\n";
    cout<<"------------------------------------------------------------------\n";
    cout<<"|Рік | 1  | 2  | 3  | 4  | 5  | 6  | 7  | 8  | 9  | 10 | 11 | 12 |\n";
    cout<<"------------------------------------------------------------------\n";
     for(int i = 0; i < 2; i++){
        if(i == 0){
            cout<<"|2025| ";
        }
        else if(i == 1){
            cout<<"|2024| ";
        }
        for(int j = 0; j < 12; j++){
           cout<<s[i][j]<<" | ";
        }
        cout<<"\n------------------------------------------------------------------\n";
    }
    int min24 = s[1][0];
    int a24 = 0;
    for(int i = 0; i < 2; i++){
        for(int j = 0; j < 12; j++){
            if (i == 1) {
                if (s[i][j] < min24) {
                    min24 = s[i][j];
                    a24 = j + 1;
                }
            }
        }
    }
    if (a24 == 0) {
        a24 = 1;
    }
    cout << "Самое маленькое количество осадков в 2024 году выпала в " << a24 << " месяце с влажностью " << min24 << "мм\n";
    int min25 = s[0][0];
    int a25 = 0;
    for(int i = 0; i < 2; i++){
        for(int j = 0; j < 12; j++){
            if (i == 0) {
                if (s[i][j] < min25) {
                    min25 = s[i][j];
                    a25 = j + 1;
                }
            }
        }
    }
    if (a24 == 0) {
        a24 = 1;
    }
    cout << "Самое маленькое количество осадков в 2025 году выпала в " << a25 << " месяце с влажностью " << min25 << "мм\n";

    int max24 = s[1][0];
    int maxa24 = 0;
    for(int i = 0; i < 2; i++){
        for(int j = 0; j < 12; j++){
            if (i == 1) {
                if (s[i][j] > max24) {
                    max24 = s[i][j];
                    maxa24 = j + 1;
                }
            }
        }
    }
    if (maxa24 == 0) {
        maxa24 = 1;
    }
    cout << "Самое высокое количество осадков в 2024 году выпала в " << maxa24 << " месяце с влажностью " << max24 << "мм\n";
    int max25 = s[0][0];
    int maxa25 = 0;
    for(int i = 0; i < 2; i++){
        for(int j = 0; j < 12; j++){
            if (i == 0) {
                if (s[i][j] > max25) {
                    max25 = s[i][j];
                    maxa25 = j + 1;
                }
            }
        }
    }
    if (maxa24 == 0) {
        maxa24 = 1;
    }
    cout << "Самое высокое количество осадков в 2025 году выпала в " << maxa25 << " месяце с влажностью " << max25 << "мм\n";
}