#include <iostream>
using namespace std;

int main() {
    // A: Брехун
    // B: Житель
    // C: Лицар
    int f;
    int s;
    int t;
    cout << "Вы на острове, тут есть 3 человека \n обманщик, рыцарь и житель" << endl;
    cout << "Первый говорит: Мы все обмащники! \n Второй говорит: один из нас рыцарь!" << endl;
    cout << "Третий говорит: Я рыцарь!" << endl;
    cout << "Воспрос: кто есть кто?" << endl;
    cout << "Кто рыцарь (1/2/3): ";
    cin >> f;
    cout << "Кто обманщик (1/2/3): ";
    cin >> s;
    cout << "Кто житель: (1/2/3): ";
    cin >> t;
    if (f == 3) {
        cout << "Правильно" << endl;
    }
    else {
        cout << "Не правильно!" << endl;
    }
    if (s == 1) {
        cout << "Правильно" << endl;
    }
    else {
        cout << "Не правильно!" << endl;
    }
    if (t == 2) {
        cout << "Правильно" << endl;
    }
    else {
        cout << "Не правильно!" << endl;
    }
    cout << "Ответ: первый - обманщик, второй - житель, третий - рыцарь" << endl;
    
}