#include <iostream>
using namespace std;

int main()
{
    srand(time(0));
    int s[2][12];

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            s[i][j] = rand() % 90 + 10;
        }
    }

    cout << "------------------------------------------------------------------\n";
    cout << "|                 Таблиця опадів за 2024-2025 роки               |\n";
    cout << "------------------------------------------------------------------\n";
    cout << "|Рік | 1  | 2  | 3  | 4  | 5  | 6  | 7  | 8  | 9  | 10 | 11 | 12 |\n";
    cout << "------------------------------------------------------------------\n";

    for (int i = 0; i < 2; i++) {
        if (i == 0) {
            cout << "|2025| ";
        }
        else if (i == 1) {
            cout << "|2024| ";
        }

        for (int j = 0; j < 12; j++) {
            cout << s[i][j] << " | ";
        }

        cout << "\n------------------------------------------------------------------\n";
    }

    int min24 = s[1][0];
    int a24 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 1) {
                if (s[i][j] < min24) {
                    min24 = s[i][j];
                    a24 = j + 1;
                }
            }
        }
    }

    if (a24 == 0) {
        a24 = 1;
    }

    cout << "Самое маленькое количество осадков в 2024 году выпала в "
         << a24 << " месяце с влажностью " << min24 << "мм\n";

    int min25 = s[0][0];
    int a25 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 0) {
                if (s[i][j] < min25) {
                    min25 = s[i][j];
                    a25 = j + 1;
                }
            }
        }
    }

    if (a24 == 0) {
        a24 = 1;
    }

    cout << "Самое маленькое количество осадков в 2025 году выпала в "
         << a25 << " месяце с влажностью " << min25 << "мм\n";

    int max24 = s[1][0];
    int maxa24 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 1) {
                if (s[i][j] > max24) {
                    max24 = s[i][j];
                    maxa24 = j + 1;
                }
            }
        }
    }

    if (maxa24 == 0) {
        maxa24 = 1;
    }

    cout << "Самое высокое количество осадков в 2024 году выпала в "
         << maxa24 << " месяце с влажностью " << max24 << "мм\n";

    int max25 = s[0][0];
    int maxa25 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 0) {
                if (s[i][j] > max25) {
                    max25 = s[i][j];
                    maxa25 = j + 1;
                }
            }
        }
    }

    if (maxa24 == 0) {
        maxa24 = 1;
    }

    cout << "Самое высокое количество осадков в 2025 году выпала в "
         << maxa25 << " месяце с влажностью " << max25 << "мм\n";

    int suma24 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 1) {
                suma24 = suma24 + s[i][j];
            }
        }
    }

    cout << "Загальна кількість опадів за 2024 рік складає "
         << suma24 << "мм\n";

    int suma25 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 0) {
                suma25 = suma25 + s[i][j];
            }
        }
    }

    cout << "Загальна кількість опадів за 2025 рік складає "
         << suma25 << "мм\n";

    cout << "В середньому за 1 місяць 2024 року випало "
         << suma24 / 12 << "мм опадів\n";

    cout << "В середньому за 1 місяць 2025 року випало "
         << suma25 / 12 << "мм опадів\n";

    int k24 = 0;

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 1) {
                if (s[i][j] < 30) {
                    k24++;
                }
            }
        }
    }

    int k25 = 0;
    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            if (i == 0) {
                if (s[i][j] < 30) {
                    k25++;
                }
            }
        }
    } 
    cout << "Количество сухих месяцев с влажностью меньже 30мм за 2024 год составляет "
         << k24 << endl;
    cout << "Количество сухих месяцев с влажностью меньже 30мм за 2025 год составляет "
         << k25 << endl;
    int ocin24 = s[1][8] + s[1][9] + s[1][10];
    cout << "В осень 2024 года выпало " << ocin24 << "мм осадков\n";
    int zima24 = s[1][11] + s[1][12] + s[1][1];
    cout << "В зиму 2024 года выпало " << zima24 << "мм осадков\n";
    int vesna24 = s[1][2] + s[1][3] + s[1][4];
    cout << "В весну 2024 года выпало " << vesna24 << "мм осадков\n";
    int leto24 = s[1][5] + s[1][6] + s[1][7];
    cout << "В лето 2024 года выпало " << leto24 << "мм осадков\n";
    int ocin25 = s[0][8] + s[0][9] + s[0][10];
    cout << "В осень 2025 года выпало " << ocin25 << "мм осадков\n";
    int zima25 = s[0][11] + s[0][12] + s[0][1];
    cout << "В зиму 2025 года выпало " << zima25 << "мм осадков\n";
    int vesna25 = s[0][2] + s[0][3] + s[0][4];
    cout << "В весну 2025 года выпало " << vesna25 << "мм осадков\n";
    int leto25 = s[0][5] + s[0][6] + s[0][7];
    cout << "В лето 2025 года выпало " << leto25 << "мм осадков\n";
}

